import math                                                                 #импортируем библиотеку math

R = int(input("\nВведите значиние радиуса окружности(см):\n"))              #значение радиуса
PI = math.pi                                                                #значение числа пи из библиотеки math

length = 2*PI*R                                                             #подсчёт длины
square = PI*R*R                                                             #подсчёт площади

print("Длина окружности:",length,"см. или",length/100,"м.")                  #вывод длины в см и м
print("Площадь окружности:",square,"см^2 или",square/10000, "м^2")           #вывод площади в см^2 и м^2

print("\nДлина стороны вписанного в окружность квадрата:",R*(2**0.5),"см. или",(R*(2**0.5))/100,"м.")                           #вывод стороны квадрата в см и м
print("Длина стороны вписанного в окружность равностороннего треугольника:",R*(3**0.5),"см. или",(R*(3**0.5))/100,"м.")         #вывод стороны треугольника в см и м

print("\nДлина стороны описанного около окружности квадрата:",R*2,"см. или",(R*2)/100,"м.")                                                 #вывод стороны описаного квадрата в см и м
print("Длина стороны описанного около окружности равностороннего треугольника:",(R*2)*(3**0.5),"см. или",((R*2)*(3**0.5))/100,"м.")         #вывод стороны описаного треугольника в см и м
print("Длина стороны описанного около окружности правильного восьмиугольника:",(R*2)*((2**0.5)-1),"см. или",((R*2)*((2**0.5)-1))/100,"м.")  #вывод стороны описаного восьмиугольника в см и м