

name = input("\nДобрый день! Введите имя, по которому к Вам можно обратиться:\n")
print("Добрый день,",name,"! Введите Ваш возраст, и я посчитаю, сколько Вам осталось до пенсии в годах:")
age = int(input())

#Считаем сколько осталось лет

retirement_age = 63 - age

#Подстановка к ответу нужных форм слова
x = retirement_age % 10     #переменная позваляющая в дальнейшем определить нужные слова при выводе текста

if retirement_age <= 0:
    print("Вы уже находитесь на пенсии. Всего доброго")        


elif x == 1 and retirement_age != 11:
    print("Вам до пенсии остался:",retirement_age,"год. Всего доброго.")
elif x in {2,3,4} and retirement_age not in {12,13,14}:
    print("Вам до пенсии осталось:",retirement_age,"года. Всего доброго.")
else:
    print("Вам до пенсии осталось:",retirement_age,"лет. Всего доброго.")